{
  "version": "https://jsonfeed.org/version/1",
  "title": "LOUD for Cultural Heritage – PhD Thesis by Julien A. Raemy",
  "description": "A website about my PhD – Linked Open Usable Data for Cultural Heritage: Perspectives on Community Practices and Semantic Interoperability",
  "language": "en-gb",
  "home_page_url": "https://phd.julsraemy.ch",
  "feed_url": "https://phd.julsraemy.ch/feed.json",
  "favicon": "https://phd.julsraemy.ch/data/favicon.ico",
  "authors": [
    {
        "name": "Julien A. Raemy",
        "url": "https://julsraemy.ch",
        "avatar": "https://julsraemy.ch/assets/images/portrait-px.png"
    }
  ],
  "items": [
    
    {
      "id": "https://phd.julsraemy.ch/",
      "url": "https://phd.julsraemy.ch/",
      "title": "LOUD for Cultural Heritage",
      "content_html": "LOUD for Cultural Heritage – PhD Thesis by Julien A. Raemy “Linked Open Usable Data (LOUD) for Cultural Heritage&quot; not only encapsulates the essence of my PhD thesis, but also reflects a passion, as I have been actively involved in both the International Image Interoperability Framework (IIIF) and the Linked Art communities for many years. It describes a vision where cultural heritage institutions and beyond actively cultivate collaboration and enthusiastically embrace community-driven standards that enable semantic interoperability. In cases where implementation of the standards may not be feasible, I advocate that institutions consider adopting LOUD design principles as essential socio-technical practices. An HTML version of my thesis will be accessible on this site upon its completion, while the research outcomes associated with my PhD can also be found here. If you just want to know more about LOUD, I’ve written a summary about its design principles and community-driven standards. Status 🌱 Start of the PhD: 1 February 2021 💻 Research &amp; Writing: February 2021 - July 2024 📄 Dissertation Submitted: 5 August 2024 🎤 Oral Examination Scheduled: 18 November 2024 🍾 Celebration 🎓 Official Publication Context My journey into the Digital Humanities Lab of the University of Basel began as an undergraduate in Information Science, undertaking an internship that spanned from August to October 2016. This period marked the start of my deep involvement with the IIIF community, a pivotal step that would significantly shape my academic and research pursuits. The experience gained during this internship not only provided me with a solid foundation in Digital Humanities but also sparked my interest in leveraging linked open data and standardised application programming interfaces (APIs) for cultural heritage preservation and accessibility. It was within one of these stimulating environments that I found the inspiration and support needed to embark on a doctoral journey, starting my PhD in February 2021. The thesis is grounded as part of the SNSF-funded Participatory Knowledge Practices in Analogue and Digital Image Archives (PIA) research project (2021-2025), a four-year interdisciplinary effort, which aims to develop a Citizen Science platform around three photographic collections from the archives of Cultural Anthropology Switzerland (CAS), formerly the Swiss Society for Folklore Studies, i.e. the Atlas of Swiss Folklore (SGV_05), Kreis Family (SGV_10), and Ernst Brunner (SGV_12). The research project is led by the University of Basel (Institute for Cultural Anthropology and European Ethnology as well as the Digital Humanities Lab) and the Bern Academy of the Arts (Hochschule der Künste Bern - HKB). I was formally involved within the PIA project between February 2021 and March 2024 as an Assistant at the Digital Humanities Lab. Additionally, starting June 2021, I worked with a 20% position as an Interoperability Specialist at DaSCH, Swiss National Data and Service Center for the Humanities, a position that I held until October 2024. I continue to be involved in the project beyond March 2024, albeit solely through my PhD thesis, which was submitted on 5 August 2024 and is planned to be defended on 18 November 2024. In parallel, I have started a new position as a Data Scientist at the Swiss Federal Archives. There is more information about the PIA research project and my involvement therein on a dedicated page. From Working Titles to Final Title The dissertation had a few titles: Current and final title of the dissertation: Linked Open Usable Data for Cultural Heritage: Perspectives on Community Practices and Semantic Interoperability Fifth working title of the dissertation: Linked Open Usable Data for Cultural Heritage: Perspectives on Semantics and Interoperability Fourth working title of the dissertation: Linked Open Usable Data for Citizen Science: Perspectives on Interoperability and Knowledge Representation through and beyond an Actor-Network Theory Lens Third working title of the dissertation: Deploying a Citizen Humanities infrastructure with Linked Open Usable Data (LOUD) standards: perspectives on Interoperability and Knowledge Representation Second working title of the dissertation: Web-based standards for Citizen Science initiatives in the cultural heritage domain: from data modelling to deploying an open infrastructure First working title of the dissertation: The role of open and interoperable standards in the dissemination of digital cultural heritage objects",
      "date_published": "2024-08-19T00:00:00.000Z"
    },
    
    {
      "id": "https://phd.julsraemy.ch/loud.html",
      "url": "https://phd.julsraemy.ch/loud.html",
      "title": "LOUD for Cultural Heritage – Linked Open Usable Data",
      "content_html": "ol { list-style-type: upper-alpha; } Linked Open Usable Data (LOUD) The Semantic Web, with its use of Resource Description Framework (RDF) graphs, offers significant potential for data modelling and reasoning, but faces challenges in terms of query complexity, data handling, and visualisation. Despite these obstacles, the advent of JavaScript Object Notation for Linked Data (JSON-LD) represents a notable advance, providing a flexible data representation that addresses some of these issues by allowing dual treatment as both JSON and a graph. Linked Open Data (LOD) has been pivotal in fostering a web of openly connected datasets. The progression to Linked Open Usable Data (LOUD) underscores an evolution towards making data not just accessible and linked but also readily usable for a broader audience, particularly software developers. This shift is propelled by the understanding that data’s real value is unlocked through its usage. LOUD aims to enhance scalability, both from technical perspectives and in terms of data production and adoption, making data more interconnected and thus more useful. JavaScript Object Notation for Linked Data (JSON-LD) JSON-LD is a modern web standard designed to simplify the encoding of linked data using the widely known JSON format. As a compact and easy-to-manage data format, JSON-LD enhances the ability to share structured data across disparate systems on the Web, while embedding rich semantic capabilities. It achieves this by allowing data to be serialised in a way that is compatible with traditional JSON, yet interpretable by RDF-based semantic processing tools. At its core, JSON-LD introduces a context (@context) that maps terms in a JSON document to Internationalised Resource Identifiers (IRIs) used in RDF vocabularies. This mapping allows JSON documents to be interpreted as RDF graphs, facilitating the integration of structured data into the Semantic Web without requiring developers to depart from familiar JSON syntax. The design of JSON-LD aims to bridge the gap between the ease of use of JSON and the rich data connectivity and interoperability offered by RDF. The development of JSON-LD was motivated by the need to make linked data more accessible to Web developers and to encourage wider adoption of Semantic Web technologies. By embedding semantic annotations directly into JSON, JSON-LD enables developers to contribute to the linked data cloud with a minimal learning curve, accelerating the growth of a semantically rich, interconnected web of data. Per the JSON-LD 1.1. specification: JSON-LD is a concrete RDF syntax as described in RDF11-CONCEPTS. Hence, a JSON-LD document is both an RDF document and a JSON document and correspondingly represents an instance of an RDF data model. However, JSON-LD also extends the RDF data model to optionally allow JSON-LD to serialize generalized RDF Datasets. The strategic adoption of JSON-LD as a means to reconcile the simplicity of JSON with the descriptive power of RDF has sparked an insightful debate about its practical implications and its classification as a polyglot format. A blog post by Tess O’Connor outlines several challenges that emerge from this approach, including issues related to dual data models, algorithmic complexity, and the potential brittleness and performance impacts of JSON-LD’s @context mechanism. To address these challenges, a strategic focus on simplicity and clarity is advocated. Adopting a straightforward JSON format that doesn’t require knowledge of RDF can simplify interactions and improve the appeal and usability of the data. In addition, creating canonical mappings from JSON to RDF addresses the needs of RDF users while maintaining the accessibility of the base format. In addition, the adoption of stable sets of @context is critical for consistent data exchange. However, this polyglot characterisation of JSON-LD has been met with counter-arguments, such as those from Pierre-Antoine Champin, that offer a different perspective. Critics argue that JSON-LD should not be considered a polyglot format in the strictest sense because it operates on a “JSON then JSON-LD” basis rather than an “either/or” scenario. In this view, any JSON-LD processor first interprets the document as JSON before applying the JSON-LD layer, similar to how other JSON formats, such as GeoJSON, encode specific types of information beyond the basic JSON structures. This process does not make these formats polyglots, but rather extensions of JSON that provide mappings to more complex data models, thus emphasising JSON-LD’s role in simplifying the transition to semantically enriched data on the web. Building upon this understanding, the LOUD design principles emerge as guiding forces in the quest to make data not only accessible and interconnected but fundamentally usable and intuitive for developers and end-users alike. LOUD Design Principles One of the main purposes of LOUD is to make the data more easily accessible to software developers, who play a key role in interacting with the data and building software and services on top of it, and to some extent to academics. As such, striking a delicate balance between the dual imperatives of data completeness and accuracy, which depend on the underlying ontological construct, and the pragmatic considerations of scalability and usability, becomes imperative. Similar to Tim-Berners Lee’s Five Star Open Data Deployment Scheme, Robert Sanderson listed five design principles that underpin LOUD: The right Abstraction for the audience Few Barriers to entry Comprehensible by introspection Documentation with working examples Few Exceptions, instead many consistent patterns A. The right Abstraction for the audience Developers do not need the same level of access to data as ontologists, in the same way that a driver does not need the same level of access to the inner workings of their car as a mechanic. Use cases and requirements should drive the interoperability layer between systems, not ontological purity. B. Few Barriers to entry It should be easy to get started with the data and build something. If it takes a long time to understand the model, ontology, sparql query syntax and so forth, then developers will look for easier targets. Conversely, if it is easy to start and incrementally improve, then more people will use the data. C. Comprehensible by introspection The data should be understandable to a large degree simply by looking at it, rather than requiring the developer to read the ontology and vocabularies. Using JSON-LD lets us to talk to the developer in their language, which they already understand. D. Documentation with working examples You can never intuit all of the rules for the data. Documentation clarifies the patterns that the developer can expect to encounter, such that they can implement robustly. Example use cases allow contextualization for when the pattern will be encountered, and working examples let you drop the data into the system to see if it implements that pattern correctly. E. Few Exceptions, instead many consistent patterns Every exception that you have in an API (and hence ontology) is another rule that the developer needs to learn in order to use the system. Every exception is jarring, and requires additional code to manage. While not everything is homogenous, a set of patterns that manage exceptions well is better than many custom fields. LOUD Standards Systems embodying LOUD principles include the International Image Interoperability Framework (IIIF), the Web Annotation Data Model, and Linked Art, demonstrating the ethos of making data more accessible, connected, and usable: International Image Interoperability Framework (IIIF), especially the IIIF Presentation API 3.0 which describes how the structure and layout of a digital object can be made available in a standard manner, defining their appearance in viewers and players through the Manifest, a JSON-LD file bundling all elements of a IIIF resource with essential metadata and structural information. Web Annotation Data Model: It offers a standardised framework for creating annotations on web resources, promoting semantic data integration and use across the web. Linked Art: A community effort to define a metadata application profile and API for describing and interacting with cultural heritage resources. IIIF and Linked Art are exemplary community-driven efforts, where ongoing engagement and collaboration within their respective communities ensure continuous development and updates. As for the Web Annotation Data Model, while it doesn’t operate as an active community, it remains a recognised LOUD standard. In the event that updates are needed, a dedicated World Wide Web Consortium (W3C) working group would probably be re-established or revamped. IIIF IIIF is both a model for presenting and annotating content as well as a global community that develops shared application programming interfaces (APIs), implements them in software, and exposes interoperable content. IIIF was initially established in 2011 as a community-based initiative that emerged from the convergence of two pivotal endeavours. One strand of this narrative revolved around the imperative to facilitate the seamless exchange of high-definition images over the internet. This aspiration arose as a practical solution to mitigate the proliferation of duplicated images required for distinct projects. The desire to avoid the necessity of sending substantial volumes of image data via conventional methods, such as mailing terabytes of data on hard drives, led to the contemplation of a web-based approach for sharing images that could break down silos. The second strand, interwoven with the first, emanated from the explorations and experiments surrounding the interoperability of digitised medieval manuscripts. The DMSTech group at Stanford, operational from 2010 to 2013, provided the fertile ground for these reflections. These deliberations ultimately led to the development of the Shared Canvas Data Model, which remains a foundational influence on the IIIF Presentation API to this day. As of August 2024, IIIF has introduced six specifications, with the Image and Presentation APIs being the most notable, both updated to version 3 in June 2020 and often considered the core IIIF APIs. Additionally, the Content Search and Authorization Flow APIs, both at version 2 and released in 2022 and 2023 respectively, are expected to receive updates to match the core APIs’ standards. The Change Discovery and Content State APIs, both in version 1.0, play essential roles in discovering, aggregating, and sharing IIIF resources. The development of the IIIF specifications is firmly rooted in the IIIF design principles, which have influenced similar methodologies such as the LOUD design principles. These principles emphasise clear, practical goals aligned with shared use cases to meet the needs of developers effectively. By focusing on simplicity, minimal barriers to entry, and adherence to good web and Linked Data practices, these principles have been crucial in making the IIIF APIs both user-friendly and technically sound. They advocate for ease of implementation and internationalisation, promoting a flexible yet cohesive structure that naturally leads to usable and accessible data. IIIF Image API The IIIF Image API is a RESTful web service that allows users to interact with images in a highly flexible manner. It facilitates the retrieval of images via standard HTTPS requests, effectively serving as an agreement between an image client and an image server to deliver image pixels. This API defines its own URI syntax, enabling users to interact with images in two primary modes: image requests and image information requests. In the image request mode, users can retrieve a specific image derived from the underlying content, with parameters that control the region, size, rotation, quality, and format of the returned image. This allows for advanced functionalities such as panning, deep zooming, and the sharing of specific regions of interest within an image. The image information request mode (info.json) provides details about the image service itself in JSON-LD, including the characteristics and available functionalities of the image service. IIIF Presentation API The IIIF Presentation API’s goal is to deliver structured and human-readable information about digital objects or collections, designed to drive remote viewing experiences. It is a JSON-LD-based framework for displaying minimal descriptive and legal metadata, focusing primarily on enhancing the user experience rather than providing semantic metadata for search engines. However, it does offer flexibility for IIIF adopters to incorporate structured metadata for discovery purposes through properties like rdfs:seeAlso. Loosely based on the Shared Canvas Data Model, the Presentation API organises content into four main resource types: Collection, Manifest, Canvas, and Range. Each of these serves a distinct function within the API’s framework, enabling a rich and interactive presentation of digital objects. Additionally, the API integrates types defined by the Web Annotation Data Model, such as AnnotationCollection, AnnotationPage, Annotation, and Content, further enhancing its capacity to deliver detailed and structured digital content. Compatible software These APIs, central to the IIIF ecosystem, underscore the initiative’s commitment to interoperability, flexibility, and a user-centric approach in the handling and presentation of digital images and their associated metadata. The widespread adoption of these APIs by numerous institutions around the world highlights their robustness and utility. The suite of IIIF-compliant software encompasses a diverse range of tools, each catering to specific aspects of the framework. Central to this suite are image servers, predominantly tailored to align with the IIIF Image API, such as IIPImage, Cantaloupe, or SIPI. Complementing these servers are image viewers, designed to be compatible with either the Image API alone, like OpenSeadragon (OSD) and Leaflet-IIIF, or with both of the core IIIF APIs. With the release of version 3.0 of the Presentation API, A/V players have also been developed, which frequently comply with the Image API as well. Examples of known clients that support the Image and Presentation APIs 3.0 are Mirador, the Universal Viewer (UV), Annona, Clover, and Ramp. As support and behaviour vary, a dedicated IIIF 3.0 Viewer Matrix was created. The embedded viewer below is Mirador, a powerful IIIF-compliant client. Stanford University played a pivotal role in rebuilding it, marking a key milestone that exemplifies the spirit of community-driven effort within the IIIF initiative. This endeavour, which has since been placed in the hands of the community, was later augmented through a collaborative partnership with Harvard University Library. The cooperative dynamics and collective contributions fundamental to the success and advancement of IIIF are clearly reflected in the widespread adoption and continued development of Mirador. You need an iFrame capable browser to view this. Web Annotation Data Model The Web Annotation Data Model is a W3C standard that provides an extensible and interoperable framework for creating and sharing annotations across various platforms. It defines relationships between resources using an RDF graph, which includes key components such as the annotation, a web resource, the body, and the target. This model allows a single comment to be associated with multiple resources, enhancing the semantic integration of data across the web. The Web Annotation Working Group, which was chartered from August 2014 to October 2016 and extended to February 2017, played a pivotal role in developing and officially vetting this specification as a standard. Here is an example of machine-generated annotations in a IIIF setting. The JSON-LD snippet represents an AnnotationPage that contains one or more annotations related to a particular IIIF resource. { &quot;@context&quot;: &quot;http://iiif.io/api/presentation/3/context.json&quot;, &quot;id&quot;: &quot;https://iiif.participatory-archives.ch/annotations/SGV_12N_08589-p1-list.json&quot;, &quot;type&quot;: &quot;AnnotationPage&quot;, &quot;items&quot;: [ { &quot;@context&quot;: &quot;http://www.w3.org/ns/anno.jsonld&quot;, &quot;id&quot;: &quot;https://iiif.participatory-archives.ch/annotations/SGV_12N_08589-p1-list/annotation-436121.json&quot;, &quot;motivation&quot;: &quot;commenting&quot;, &quot;type&quot;: &quot;Annotation&quot;, &quot;body&quot;: [ { &quot;type&quot;: &quot;TextualBody&quot;, &quot;value&quot;: &quot;person&quot;, &quot;purpose&quot;: &quot;commenting&quot; }, { &quot;type&quot;: &quot;TextualBody&quot;, &quot;value&quot;: &quot;Object Detection (vitrivr)&quot;, &quot;purpose&quot;: &quot;tagging&quot; }, { &quot;type&quot;: &quot;TextualBody&quot;, &quot;value&quot;: &quot;&lt;br&gt;&lt;small&gt;Detection score: 0.9574&lt;/small&gt;&quot;, &quot;purpose&quot;: &quot;commenting&quot; } ], &quot;target&quot;: { &quot;source&quot;: &quot;https://iiif.participatory-archives.ch/SGV_12N_08589/canvas/p1&quot;, &quot;selector&quot;: { &quot;type&quot;: &quot;FragmentSelector&quot;, &quot;conformsTo&quot;: &quot;http://www.w3.org/TR/media-frags/&quot;, &quot;value&quot;: &quot;xywh=319,2942,463,523&quot; }, &quot;dcterms:isPartOf&quot;: { &quot;type&quot;: &quot;Manifest&quot;, &quot;id&quot;: &quot;https://iiif.participatory-archives.ch/SGV_12N_08589/manifest.json&quot; } } }, Body The body of an annotation is where the content of the annotation is defined. In this example, there are three textual bodies: A “TextualBody” with the value “person” for commenting. Another “TextualBody” with the value “Object Detection (vitrivr)” for tagging. A third “TextualBody” with HTML content indicating a detection score, also for commenting. These bodies represent the content of the annotation, including comments and tags related to the annotated resource. Target The target specifies where the annotation applies. In this setting, it points to a specific area of a IIIF Canvas. Key details include: The source URL, identifying the specific Canvas within this IIIF Presentation API 3.0 resource. A selector of type “FragmentSelector”, using the Media Fragments specification (with a value indicating the specific rectangular area on the canvas targeted by the annotation). A link (dcterms:isPartOf) to the IIIF Manifest that the Canvas is part of. Linked Art Linked Art is a community and a CIDOC (ICOM International Committee for Documentation) Working Group collaborating to define a metadata application profile for describing cultural heritage, and the technical means for conveniently interacting with it. It aims to solve problems from real data, is designed for usability and ease of implementation, which are prerequisites for sustainability. Linked Art presents a layered framework that distinguishes between the conceptual and implementation aspects. At its core, Linked Art is a data model or metadata application profile that draws extensively from the RDF implementation of version 7.1.1 of CIDOC-CRM. The Getty Vocabularies are leveraged as core sources of identity for domain-specific terminology. JSON-LD 1.1 is chosen as the preferred serialisation format, promoting clarity and interoperability. This framework constructs common patterns, integrating conceptual models, ontologies, and vocabulary terms. These elements are derived from real-world scenarios and contributions from the diverse participants and institutions within the Linked Art community. Level Linked Art Conceptual Model CIDOC Conceptual Reference Model (CRM) Ontology RDF encoding of CRM 7.1, plus extensions Vocabulary Getty Vocabularies, mainly the Art &amp; Architecture Thesaurus (AAT), as well as the Thesaurus of Geographic Names (TGN) and the Union List of Artist Names (ULAN) Profile Object-based cultural heritage (mainly art museum oriented) API JSON-LD 1.1, following representational state transfer (REST) and web patterns The Linked Art data model, in its domain-specific application, particularly resonates with five of these facets: “what,” “where,” “who,” “how,” and “when.” Linked Art from 50,000 feet Exploring the specifics of the Linked Art API, four key areas are highlighted: ease of implementation, consistency across representations, division of information, and URI requirements. Linked Art prioritises ease of implementation, making it simple enough to deploy even with hand-crafted files, though automation is preferred for larger data volumes. A crucial aspect is ensuring consistency across representations, with each relationship contained within a single document to maintain clarity and coherence. The framework also emphasises the division of information, scaling from many to few - such as from a page to a book, and then to a collection - ensuring a clear hierarchy. The API’s identity and URI requirements are designed for simplicity. One-to-one relationships are embedded directly without needing separate URIs, making the data model more accessible. URIs for records are kept simple, with no internal structure, ensuring ease of use and navigation. This approach makes Linked Art an efficient tool for representing and managing cultural heritage data. In Linked Art, the division of the graph avoids duplication of definitions across records. Full URIs are used for references, simplifying client processing. Embedded structures do not carry URIs, preventing unnecessary complexity. The Linked Art API currently features eleven endpoints, which align with the conceptual model: Concepts: Types, materials, languages, and others as full records rather than external references Digital Objects: Images, services, and other digital objects Events: Related activities that are not part of other entities Groups: Groups and organisations People: Individuals Physical Objects: Artworks, buildings, books, and other physical items Places: Geographic locations Provenance Activities: Events in the history of a physical item Sets: Collections and exhibition sets Textual Works: Distinct textual entities like book content or journal articles Visual Works: Image content like paintings or drawings Each endpoint is supported by detailed documentation, including the required and permitted patterns, along with a corresponding JSON schema. LOUD Ecosystem These three systems are complementary and can be used either separately or in conjunction. LOUD-Driven Infrastructure [Felsing et al. 2023] A LOUD ecosystem is characterised by an emphasis on interoperability between independently developed systems. This approach to design and implementation promotes semantic interoperability, ensuring that data can be understood and used across platforms and applications without the need for centralised coordination. By adhering to the LOUD principles, systems can communicate more effectively and share data in a way that is meaningful and useful to a wide range of users. This level of interoperability supports the creation of a more integrated and accessible digital environment, where data from different sources can be seamlessly connected and used for a variety of purposes.",
      "date_published": "2024-08-19T00:00:00.000Z"
    },
    
    {
      "id": "https://phd.julsraemy.ch/pia.html",
      "url": "https://phd.julsraemy.ch/pia.html",
      "title": "LOUD for Cultural Heritage – Participatory Knowledge Practices in Analogue and Digital Image Archives (PIA)",
      "content_html": "Participatory Knowledge Practices in Analogue and Digital Image Archives (PIA) Participatory Knowledge Practices in Analogue and Digital Image Archives (PIA) is a project funded by the Swiss National Science Foundation (SNSF) under the Sinergia funding scheme from February 2021 to January 2025. The PIA project wanted to bridge the realms of data and tangible objects through an interdisciplinary approach, bringing together cultural anthropology, technology and design to examine both analogue and digital archives. It explored participatory knowledge practices within image archives, encourages collaboration across disciplines, and develops digital tools to help contextualise and connect images. This initiative aimed to improve the preservation and sharing of knowledge by inviting both the scholarly community and the public to actively participate in understanding its history and current practices. Through workshops and user interviews, the project identified new needs in digital and process-oriented knowledge creation. Using three collections from the photographic archives of Cultural Anthropology Switzerland (CAS), the project developed interfaces for collaborative indexing and access to archival content. These interfaces, including both graphical and application programming interfaces (APIs), facilitate the co-creation and visualisation of knowledge and offer a reflective and intuitive user experience. At the same time, the project assessed the analogue and digital phases of archiving from an anthropological, technical and communicative point of view, involving experts from the University of Basel and the Bern University of the Arts. Atlas of the Swiss Folklore SGV_05 Atlas of Swiss Folklore consists of 292 maps and 1,000 pages of commentary published between 1950 and 1995. Commissioned by CAS, the collection involved an extensive survey of the Swiss population in the 1930s and 1940s, covering topics like everyday life, local laws, superstitions, celebrations, and labour. The survey was conducted by both researchers and local contributors, resulting in a collection that reflects everyday life in Switzerland before the postwar modernisation period. The project also involved significant efforts in restoration, digitisation, cataloguing, and indexing as part of the PIA research project. Kreis Family SGV_10 Kreis Family comprises approximately 20,000 photographic objects, with a quarter organised into 93 photo albums. This collection, spanning from the 1850s to the 1980s, belonged to a wealthy Basel family and was acquired by CAS in 1991. Despite its initial disorganisation, CAS meticulously catalogued and preserved the collection, which offers a detailed insight into urban bourgeois culture and the development of private photography over a century. The materials range from prints to negatives, in various formats and techniques, from daguerreotypes to modern paper prints. While some were digitised in 2014, most of the work was completed during the PIA project. You need an iFrame capable browser to view this. Ernst Brunner SGV_12 Ernst Brunner is a collection of about 48,000 negatives and 20,000 prints donated to the CAS archives by Ernst Brunner, a self-taught photojournalist active mainly in the 1930s and 1940s. His work, which documents Swiss society’s rural and urban life, is highly regarded. Brunner, who initially worked as a carpenter influenced by the Bauhaus and Neues Bauen movements, became a key visual chronicler of his era. While the black and white negatives were digitised between 2014 and 2018, the prints selected by Brunner were digitised at the end of the PIA research project. Brunner, Ernst. [Ringtanz während der Masüras auf der Alp Sura]. Guarda, 1939. Black and White Negative, 6x6cm. SGV_12 Ernst Brunner. SGV_12N_08589",
      "date_published": "2024-02-29T00:00:00.000Z"
    },
    
    {
      "id": "https://phd.julsraemy.ch/thesis.html",
      "url": "https://phd.julsraemy.ch/thesis.html",
      "title": "Linked Open Usable Data for Cultural Heritage: Perspectives on Community Practices and Semantic Interoperability",
      "content_html": "Linked Open Usable Data for Cultural Heritage: Perspectives on Community Practices and Semantic Interoperability PhD Thesis in Digital Humanities affiliated with the Graduate School of Social Sciences’ (G3S) doctoral programme. PDF Version (e-dissertation) on the University of Basel’s repository: (…) Submitted on 5 August 2024 Defence scheduled for 18 November 2024 Author Julien A. Raemy (University of Basel) https://orcid.org/0000-0002-4711-5759 Supervisors Prof. Dr. Peter Fornaro (University of Basel) https://orcid.org/0000-0003-1485-4923 Prof. Dr. Walter Leimgruber (University of Basel) Dr. Robert Sanderson (Yale University) https://orcid.org/0000-0003-4441-6852 Abstract This doctoral thesis explores the impact of digital technologies on the accessibility and engagement with cultural heritage (CH) collections, focusing on web standards known as Linked Open Usable Data (LOUD) specifications. These include the International Image Interoperability Framework (IIIF) Presentation API 3.0, Linked Art, and the W3C Web Annotation Data Model, which have been developed to facilitate the description and dissemination of CH resources. Despite the widespread adoption of IIIF, the implementation of LOUD specifications, particularly when used in combination, presents significant challenges, especially in developing and assessing the infrastructures that support these standards. The research is guided by two primary perspectives: community practices and semantic interoperability. The first examines how organisations, individuals, and tools contribute to the consensus-making processes within the LOUD ecosystem, offering insights into the social structures that underpin these practices. The second perspective explores how data can be standardised and made interoperable to ensure meaningful machine-readable information, facilitating well-formed data exchange. This work is part of the SNSF-funded research project Participatory Knowledge Practices in Analogue and Digital Image Archives (PIA) (2021-2025), which aims to develop a citizen science platform around three photographic collections from the archives of Cultural Anthropology Switzerland (CAS). The theoretical framework is firmly rooted in Actor-Network Theory (ANT), with the thesis aiming to describe the collaborative structures of the LOUD ecosystem and highlight the role of non-human actors. Beyond the implementation of LOUD standards within the PIA research project, the empirical research includes an analysis of the social structures within the IIIF and Linked Art communities, as well as an investigation of LUX, Yale Collections Discovery platform. This research seeks to identify the socio-technical requirements for developing specifications that align with LOUD design principles. Additionally, it examines how implementing LOUD standards within PIA reveals their potential benefits and limitations in facilitating data reuse and broader participation. The thesis also delves into Yale University’s large-scale deployment of LOUD standards, focusing on the consistency of Linked Art and IIIF resources within the LUX platform and their contribution to the CH domain. The methodology employed in this thesis is an actor and practice-centred inquiry, offering a detailed examination of specific cosmologies within LOUD-driven communities, PIA, and LUX. This approach seeks to uncover the intricate cultural processes and constellations through a micro-perspective, enriched by empirical evidence. Key findings indicate that LOUD improves the discoverability and integration of CH data, requiring community-driven consensus on model interoperability. Significant challenges include engaging marginalised groups, sustaining long-term participation, and balancing technological and social factors. While LOUD presents opportunities for improving digital materiality and strategic technology use, it also poses challenges related to resource investment, data consistency, and the broader implementation of complex patterns. LOUD should lead efforts to enhance the accessibility and usability of CH data. The community-driven approaches of IIIF and Linked Art foster collaboration and transparency, making these standards essential tools in the ongoing evolution of data management. Even for projects and institutions that do not adopt these specifications, LOUD’s socio-technical practices offer valuable insights into effective digital stewardship and community engagement strategies. Keywords: Actor-Network Theory; Community of Practice; Cultural Anthropology Switzerland; Cultural Heritage; Digital Infrastructure; International Image Interoperability Framework; Knowledge Practices; Linked Art; Linked Data; LUX; Participatory Archives; Photographic Archives; Semantic Interoperability; Web Annotation Data Model Introduction (…) Context (…) Interlinking Cultural Heritage Data (…) Exploring Relationships through an Actor-Network Theory Lens (…) Research Scope and Methodology (…) The Social Fabrics of IIIF and Linked Art (…) PIA as a Laboratory (…) Yale’s LUX (…) Discussion (…) Conclusion (…) Bibliography (…) This page will host my PhD thesis in HTML format.",
      "date_published": "2024-08-05T00:00:00.000Z"
    },
    
    {
      "id": "https://phd.julsraemy.ch/research.html",
      "url": "https://phd.julsraemy.ch/research.html",
      "title": "LOUD for Cultural Heritage – Research Outcomes",
      "content_html": "Research Outcomes The main focus of this four-year endeavour was, of course, the completion of the dissertation, submitted as a monograph. In addition, contributions were made through the publication of articles in peer-reviewed journals and conference proceedings, as well as writing a book chapter. Further essential activities included developing scripts for data collection and analysis, building data pipeline workflows, and designing and implementing data models, with a particular emphasis on using Linked Open Usable Data (LOUD) standards such as Linked Art, a metadata application profile for describing cultural heritage. The research outcomes related to the PhD are organised alphabetically by category, with the most recent ones listed first within each category. Book Chapter Raemy, J. A., &amp; Sanderson, R. (2024). Analysis of the Usability of Automatically Enriched Cultural Heritage Data. In F. Moral-Andrés, E. Merino-Gómez, &amp; P. Reviriego (Eds.), Decoding Cultural Heritage: A Critical Dissection and Taxonomy of Human Creativity through Digital Tools (pp. 69–93). Springer Nature Switzerland. https://doi.org/10.1007/978-3-031-57675-1_4 Conference Papers Raemy, J. A., Gray, T., Collinson, A., &amp; Page, K. R. (2023). Enabling Participatory Data Perspectives for Image Archives through a Linked Art Workflow. In A. Baillot, W. Scholger, T. Tasovac, &amp; G. Vogeler (Eds.), Digital Humanities 2023 Book of Abstracts (Vol. 2023, pp. 515–516). Alliance of Digital Humanities Organizations (ADHO). https://doi.org/10.5451/unibas-ep95099 Felsing, U., Fornaro, P., Frischknecht, M., &amp; Raemy, J. A. (2023). Community and Interoperability at the Core of Sustaining Image Archives. Digital Humanities in the Nordic and Baltic Countries Publications, 5(1), 40–54. https://doi.org/10.5617/dhnbpub.10649 Manz, M. C., Raemy, J. A., &amp; Fornaro, P. (2023). Recommended 3D Workflow for Digital Heritage Practices. Archiving Conference, 20, 23–28. https://doi.org/10.2352/issn.2168-3204.2023.20.1.5 Raemy, J. A., &amp; Gautschy, R. (2023). Élaboration d’un processus pour les images 3D reposant sur IIIF. In S. Gabay, E. Leblanc, N. Carboni, R. Suciu, G. Lini, M. Barras, &amp; F. Idmhand (Eds.), Recueil des communications du 4e colloque Humanistica (pp. 1–3). Humanistica, l’association francophone des humanités numériques/digitales. https://doi.org/10.5451/unibas-ep94862 Raemy, J. A. (2022). Améliorer la valorisation des données du patrimoine culturel grâce au Linked Open Usable Data (LOUD). In N. Lasolle, O. Bruneau, &amp; J. Lieber (Eds.), Actes des journées humanités numériques et Web sémantique (pp. 132–149). Les Archives Henri-Poincaré - Philosophie et Recherches sur les Sciences et les Technologies (AHP-PReST); Laboratoire lorrain de recherche en informatique et ses applications (LORIA). https://doi.org/10.5451/unibas-ep89725 Raemy, J. A. (2021). Applying Effective Data Modelling Approaches for the Creation of a Participatory Archive Platform. In Y. Hou (Ed.), Human Factors in Digital Humanities (pp. 1–5). Institut des humanités digitales. https://doi.org/10.5451/unibas-ep87517 Data Curation and Analysis Raemy, J. A. (2024). The LOUD Social Fabrics [Computer software]. https://github.com/julsraemy/loud-socialfabrics/ Raemy, J. A. (2024). LOUD Consistency [Computer software]. https://github.com/julsraemy/loud-consistency Data Modelling As an integral part of both my doctoral research and active engagement in the PIA research project, I dedicated substantial efforts to data modelling. Cultural Anthropology Switzerland (CAS) Data Model CAS Data Model was redesigned for the database migration to the DaSCH Service Platform (DSP). Its JSON-LD representation is available at https://api.dasch.swiss/ontology/0812/ekws/v2. IIIF Manifests Generation Raemy, J. A. (2024). daschiiify (Version 0.2.0) [Computer software]. https://github.com/dasch-swiss/daschiiify Raemy, J. A. (2023). iiif-photoalbum (Version 0.1.0) [Computer software]. https://github.com/participatory-Image-Archives/iiif-photoalbum PhD Data Model Metamodel done in Linked Art, to be updated Raemy, J. A. (2023). Linked Art Modelling [Computer software]. https://doi.org/10.5281/zenodo.7309787 Participatory Knowledge Practices in Analogue and Digital Image Archives (PIA) Data Model Ernst Brunner Thesaurus A controlled vocabulary done in Simple Knowledge Organization System (SKOS), using SkoHub Docker Vocabs, for the preferred terms used by the photographer Ernst Brunner. It is published at https://n2t.net/ark:/19156/tkt42/. PIA Data Model Demleitner, A., &amp; Raemy, J. A. (2024). PIA Data Model (0.9) [Computer software]. https://doi.org/10.5281/zenodo.5142605 PIA Linked Art Data Model Raemy, J. A. (2022). PIA Linked Art (Version 0.1.0) [Computer software]. https://github.com/Participatory-Image-Archives/linkedart Journal Article Cornut, M., Raemy, J. A., &amp; Spiess, F. (2023). Annotations as Knowledge Practices in Image Archives: Application of Linked Open Usable Data and Machine Learning. Journal on Computing and Cultural Heritage, 16(4), 1–19. https://doi.org/10.1145/3625301 Lectures Spring Semester 2024 Within the PIA research project, we organised a lecture series during the spring semester 2024 where I gave a 2-hour presentation in one of the lessons: 70931-01 – Vorlesung: PIA. Partizipative Wissenspraktiken in analogen und digitalen Bildarchiven Spring Semester 2023 With Murielle Cornut, PhD Candidate in Cultural Anthropology at the time, we taught a 30-hour course during the spring semester 2023 at the University of Basel: 67853-01 - Practical course: Bist du sicher, dass du dieses Foto löschen möchtest? Private Fotopraxis im Archivkontext (Meta)data Aggregation Raemy, J. A. (2023). e-periodica OAI-PMH - Ethnology and Folklore (Version 1.0.0) [Computer software]. https://doi.org/10.5281/zenodo.7777797 Posters Raemy, J. A., Gray, T., Collinson, A., &amp; Page, K. R. (2023, July 12). Enabling Participatory Data Perspectives for Image Archives through a Linked Art Workflow (Poster). Digital Humanities 2023 Posters. Digital Humanities 2023, Graz, Austria. https://doi.org/10.5281/zenodo.7878358 Raemy, J. A., &amp; Gautschy, R. (2023, June 28). Élaboration d’un processus pour les images 3D reposant sur IIIF (Poster). Colloque Humanistica 2023, Genève, Suisse. https://doi.org/10.5281/zenodo.7927862 Raemy, J. A. (2022, October 20). Back and Forth from Boundary Objects to IIIF Resources: The Recipes of a Community-driven Initiative Specifying Standards. DARIAH-CH Study Day 2022 Posters. DARIAH-CH Study Day, Mendrisio, Switzerland. https://doi.org/10.5281/zenodo.7015256 Preprints Raemy, J. A., &amp; Demleitner, A. (2023). Implementation of the IIIF Presentation API 3.0 based on Software Support: Use Case of an Incremental IIIF Deployment within a Citizen Science Project. arXiv. https://doi.org/10.48550/ARXIV.2312.11116 Raemy, J. A., &amp; Sanderson, R. (2023). Analysis of the Usability of Automatically Enriched Cultural Heritage Data. arXiv. https://doi.org/10.48550/arXiv.2309.16635 Presentations I have given a lot of presentations during my PhD. On this website you can find a list of all the self-hosted presentations I have created since November 2022 using Marp (Markdown Presentation Ecosystem): https://julsraemy.ch/prezi Report Raemy, J. A. (2023). Characterising the IIIF and Linked Art Communities: Survey report (p. 29) [Report]. University of Basel. https://hal.science/hal-04162572",
      "date_published": "2024-08-21T00:00:00.000Z"
    }
    
  ]
}
